using UnityEngine;

public class TraderNPC : MonoBehaviour
{
    // TODO: Создать систему покупки товаров
    // игрок заходит в зону действия NPC и если у него есть деньги, идет прогресс бар покупки, после завершения, покупка происходит и игрок получает товар.
    // товар можно задать в инспекторе, на данный момент будет только работник.
    // должен быть публичный метод для покупки товара, который будет вызываться из игрока.
    // метод покупки товара будет иметь свою логику которую допишу позже.
}
